Autodesk.Revit.DB.Plumbing.PipingSystemType.ValidateRiseDropSymbolType(Autodesk.Revit.DB.Mechanical.RiseDropSymbol)
Confirms if the parameter is a valid piping rise/drop symbol type.
risedropType:
The type.
Returns:
True if the input is a valid piping rise/drop symbol type, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Plumbing.PipingSystemType.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.MEPSystemClassification,System.String)
Creates a new instance of a piping system type and adds it to the document.
ADoc:
The document where the element will be created and added.
systemClassification:
The classification for the piping system type to be created
name:
The name of the piping system type to be created.
Returns:
The newly created piping system type element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The system classification is not valid for the domain of this system type.
Since:
2012

Autodesk.Revit.DB.Plumbing.PipingSystemType.FluidType
Fluid Type
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: fluidTypeId is not a fluid type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Plumbing.PipingSystemType.FluidTemperature
Fluid Temperature
Since:
2012

Autodesk.Revit.DB.Plumbing.PipingSystemType.SingleLineJunctionDropType
Symbol for a 1 line junction drop
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input is not a valid piping rise/drop symbol type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Plumbing.PipingSystemType.SingleLineJunctionRiseType
Symbol for a 1 line junction rise
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input is not a valid piping rise/drop symbol type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Plumbing.PipingSystemType.SingleLineBendDropType
Symbol for a 1 line drop
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input is not a valid piping rise/drop symbol type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Plumbing.PipingSystemType.SingleLineBendRiseType
Symbol for a 1 line rise
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input is not a valid piping rise/drop symbol type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Plumbing.PipingSystemType.TwoLineDropType
Symbol for a 2 line drop
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input is not a valid piping rise/drop symbol type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Plumbing.PipingSystemType.TwoLineRiseType
Symbol for a 2 line rise
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input is not a valid piping rise/drop symbol type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Plumbing.PipingSystemType.FlowConversionMethod
The flow conversion method for the piping system type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Plumbing.PipingSystemType
Base class for piping system types
Since:
2012